Revit 2024 API
CutMarkType.CutLineDistance Property
 The distance between 2 cut lines.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double CutLineDistance { get; set; }
Visual Basic
Public Property CutLineDistance As Double
	Get
	Set
Visual C++
public:
property double CutLineDistance {
	double get ();
	void set (double value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The given value for distanceBetweenTwoLines must be greater than 0 and no more than 30000 feet.
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: The cut mark type is not a double cut line type.
See Also
CutMarkType Class
Autodesk.Revit.DB.Architecture Namespace